app/views/user/index.html.erb

SELECT COUNT(*) FROM `projects` INNER JOIN `projects_users` ON `projects`.`id` = `projects_users`.`Project_id` WHERE `projects_users`.`user_id` = 1
SELECT `projects`.* FROM `projects` INNER JOIN `projects_users` ON `projects`.`id` = `projects_users`.`Project_id` WHERE `projects_users`.`user_id` = 1
---
<div>
  <h2>Projects you're engaged in: (<%= @user.Projects.count.to_s %>)</h2>