app/controllers/projects_controller.rb

    def set_project
      @project = Project.find(params[:id])
      @project_profile = ProjectProfile.find_by_Project_id(params[:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 4 LIMIT 1
SELECT  `project_profiles`.* FROM `project_profiles` WHERE `project_profiles`.`Project_id` = 4 LIMIT 1