app/controllers/user_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
    def set_user
      if (params[:id])
        puts "----Setting to params[id] for user"
        @user = User.find(params[:id].to_i)